In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('London Housing.csv')

In [3]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN

In [4]:
df.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [5]:
duplicate = df[df.duplicated()]

In [6]:
duplicate

Empty DataFrame
Columns: [date, area, average_price, code, houses_sold, no_of_crimes]
Index: []

# Q. 1) Convert the Datatype of 'Date' column to Date-Time format.

In [7]:
df['date'] = pd.to_datetime(df['date'])

In [8]:
df.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

# Q. 2) Add a new column ''year'' in the dataframe, which contains years only.

In [9]:
df.head(3)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN
2,1995-03-01,city of london,79121,E09000001,14.0,NaN

In [10]:
df['Year'] = df.date.dt.year

In [11]:
df

,date,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,city of london,79121,E09000001,14.0,NaN,1995
3,1995-04-01,city of london,77101,E09000001,7.0,NaN,1995
4,1995-05-01,city of london,84409,E09000001,10.0,NaN,1995
...,...,...,...,...,...,...,...
13544,2019-09-01,england,249942,E92000001,64605.0,NaN,2019
13545,2019-10-01,england,249376,E92000001,68677.0,NaN,2019
13546,2019-11-01,england,248515,E92000001,67814.0,NaN,2019
13547,2019-12-01,england,250410,E92000001,NaN,NaN,2019
13548,2020-01-01,england,247355,E92000001,NaN,NaN,2020

# Q(2.B) Add a new column ''month'' as 2nd column in the dataframe, which contains month only.

In [12]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1995

In [13]:
df['month'] = df.date.dt.month

In [14]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes,Year,month
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995,1
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1995,2

# Q. 3) Remove the columns 'year' and 'month' from the dataframe.

In [15]:
df.drop(columns=['Year','month'],inplace=True)

In [16]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN

# Q. 4) Show all the records where 'No. of Crimes' is 0. And, how many such records are there ?

In [17]:
df[df['no_of_crimes']==0]

,date,area,average_price,code,houses_sold,no_of_crimes
72,2001-01-01,city of london,284262,E09000001,24.0,0.0
73,2001-02-01,city of london,198137,E09000001,37.0,0.0
74,2001-03-01,city of london,189033,E09000001,44.0,0.0
75,2001-04-01,city of london,205494,E09000001,38.0,0.0
76,2001-05-01,city of london,223459,E09000001,30.0,0.0
...,...,...,...,...,...,...
178,2009-11-01,city of london,397909,E09000001,11.0,0.0
179,2009-12-01,city of london,411955,E09000001,16.0,0.0
180,2010-01-01,city of london,464436,E09000001,20.0,0.0
181,2010-02-01,city of london,490525,E09000001,9.0,0.0
182,2010-03-01,city of london,498241,E09000001,15.0,0.0

# Q. 5) What is the maximum & minimum 'average_price' per year in england ?

In [18]:
maximum_price = df.sort_values(by="average_price" , ascending = False)

In [19]:
maximum_price.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
6001,2018-01-01,kensington and chelsea,1463378,E09000020,129.0,1737.0

In [20]:
minimum_price = df.sort_values(by="average_price" , ascending = True)

In [21]:
minimum_price.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
10553,1996-02-01,north east,40722,E12000001,2113.0,NaN

# Q. 6) What is the Maximum & Minimum No. of Crimes recorded per area ?

In [22]:
max_crime = df.sort_values(by="no_of_crimes" , ascending = False)

In [23]:
max_crime.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
9936,2019-12-01,westminster,968404,E09000033,NaN,7461.0

In [24]:
min_crime = df.sort_values(by="no_of_crimes" , ascending = True)

In [25]:
min_crime.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
72,2001-01-01,city of london,284262,E09000001,24.0,0.0

# Q. 7) Show the total count of records of each area, where average price is less than 100000.

In [26]:
df[df.average_price < 100000].area.value_counts()

area
north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
bexley                   64
waltham forest           64
lewisham                 62
havering                 60
south east               59
greenwich                59
croydon                  57
enfield                  54
sutton                   54
hackney                  53
redbridge                52
southwark                48
tower hamlets            47
outer london             46
hillingdon               44
lambeth                  41
hounslow                 41
brent                    40
london                   39
merton                   35
haringey                 33
bromley                  33
inner london             31
ealing                   31
kingston upon thames     30
harrow                   30
wandsworth               26
barnet                   25
islington                19
city of london           11
Name: count, dtype: int64